---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.DegreeC
source: html/ec476e85-7581-8b9b-cfeb-20e94e875507.htm
---
# Autodesk.Revit.DB.SymbolTypeId.DegreeC Property

Symbol °C, indicating unit Celsius.

## Syntax (C#)
```csharp
public static ForgeTypeId DegreeC { get; }
```